{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "attrs": {"__storage_type__": "2"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "enc_0_weight", 
      "attrs": {"num_hidden": "60"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "enc_0_bias", 
      "attrs": {"num_hidden": "60"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "enc_0", 
      "attrs": {"num_hidden": "60"}, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation0", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "enc_1_weight", 
      "attrs": {"num_hidden": "40"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "enc_1_bias", 
      "attrs": {"num_hidden": "40"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "enc_1", 
      "attrs": {"num_hidden": "40"}, 
      "inputs": [[4, 0, 0], [5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation1", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mean_weight", 
      "attrs": {"num_hidden": "20"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mean_bias", 
      "attrs": {"num_hidden": "20"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "mean", 
      "attrs": {"num_hidden": "20"}, 
      "inputs": [[8, 0, 0], [9, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square0", 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar0", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "logsigma_weight", 
      "attrs": {"num_hidden": "20"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "logsigma_bias", 
      "attrs": {"num_hidden": "20"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "logsigma", 
      "attrs": {"num_hidden": "20"}, 
      "inputs": [[8, 0, 0], [14, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar0", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "inputs": [[13, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar1", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "exp", 
      "name": "exp0", 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "elemwise_sub", 
      "name": "_minus1", 
      "inputs": [[18, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar2", 
      "attrs": {"scalar": "-0.5"}, 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum1", 
      "attrs": {"axis": "1"}, 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum0", 
      "attrs": {"axis": "1"}, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like0", 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "_equal", 
      "name": "_equal0", 
      "inputs": [[24, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[24, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "elemwise_div", 
      "name": "_div0", 
      "inputs": [[23, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like0", 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "elemwise_sub", 
      "name": "_minus0", 
      "inputs": [[29, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul0", 
      "inputs": [[28, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "n_epoch", 
      "inputs": []
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like2", 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul5", 
      "inputs": [[31, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar3", 
      "attrs": {"scalar": "-1.0"}, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like1", 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like1", 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "_sample_normal", 
      "name": "sample_normal0", 
      "inputs": [[36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "exp", 
      "name": "exp1", 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul1", 
      "inputs": [[38, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2", 
      "inputs": [[11, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "projection_weight", 
      "attrs": {"num_hidden": "2000"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "projection_bias", 
      "attrs": {"num_hidden": "2000"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "projection", 
      "attrs": {"num_hidden": "2000"}, 
      "inputs": [[42, 0, 0], [43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "log_softmax", 
      "name": "log_softmax0", 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul2", 
      "inputs": [[35, 0, 0], [46, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum2", 
      "attrs": {"axis": "1"}, 
      "inputs": [[47, 0, 0]]
    }, 
    {
      "op": "elemwise_div", 
      "name": "_div1", 
      "inputs": [[48, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul3", 
      "inputs": [[49, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus6", 
      "inputs": [[34, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "MakeLoss", 
      "name": "total_loss", 
      "inputs": [[51, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "kld", 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "recons", 
      "inputs": [[50, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus5", 
      "inputs": [[50, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "logppx", 
      "inputs": [[55, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    5, 
    6, 
    9, 
    10, 
    14, 
    15, 
    32, 
    43, 
    44
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57
  ], 
  "heads": [[52, 0, 0], [53, 0, 0], [54, 0, 0], [56, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10301]}
}